{
  "data": [
    {
      "id": 1,
      "Title": "Eloquent JavaScript: A Modern Introduction to Programming",
      "Author": "Marijn Haverbeke",
      "About": "JavaScript is at the heart of almost every modern Web application, whether it's Google Apps, Twitter, or the newest browser - based game. Though it's simple for beginners to pick up and play with, JavaScript is not a toy—it's a flexible and complex language that can be used to build full-scale applications.",
      "Image": "https://books.google.ca/books/content?id=UAYvDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&imgtk=AFLRE70xGZExN9NePVNTxYPXeVcrWeGdkGmOnomOsbU0FctVu7Pi72e4MHlQky4-lQmWtcmIMg9iHlaxkJ4OMZm1aVbniyEvQhmoyLN6-KBNE6Y0VR5l505vUAWBiIxINWWdMTD3VyIs"
    },
    {
      "id": 2,
      "Title": "Introduction to Algorithms",
      "Author": "Thomas H. Cormen, Charles E. Leiserson, Ronald L. Rivest, Clifford Stein",
      "About": "Some books on algorithms are rigorous but incomplete; others cover masses of material but lack rigor. Introduction to Algorithms uniquely combines rigor and comprehensiveness. The book covers a broad range of algorithms in depth, yet makes their design and analysis accessible to all levels of readers. Each chapter is relatively self-contained and can be used as a unit of study. The algorithms are described in English and in a pseudocode designed to be readable by anyone who has done a little programming. The explanations have been kept elementary without sacrificing depth of coverage or mathematical rigor.",
      "Image": "https://books.google.ca/books/content?id=i-bUBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&imgtk=AFLRE73GYXrsC0SA0ejPe43xAUnEKiPEsPhVVwGbOTLu24PDrX5QwxQxIxPEjkkW-xGhy_v7fYenYYKTuPRIgBuE6eoS1f_WCAUMc4TcLz68Zpe_nzdNTm5FuLibP2bn0R713bGlnW5U"
    },
    {
      "id": 3,
      "Title": "Machine Learning: An Artificial Intelligence Approach, Volume 1",
      "Author": "Ryszard S. Michalski, Jaime G. Carbonell, Tom M. Mitchell",
      "About": "Machine Learning: An Artificial Intelligence Approach contains tutorial overviews and research papers representative of trends in the area of machine learning as viewed from an artificial intelligence perspective. The book is organized into six parts. Part I provides an overview of machine learning and explains why machines should learn. Part II covers important issues affecting the design of learning programs—particularly programs that learn from examples. It also describes inductive learning systems. Part III deals with learning by analogy, by experimentation, and from experience. ",
      "Image": "https://books.google.ca/books/content?id=Aw2jBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&imgtk=AFLRE70nIL1UfUcyh1mFPf-JOeTOqnHs_7u6GaYoAaEKaWNcpOxv2jhmHj61PN3qJRqI7q6hqgQYottzAuBP-wFmJumJRkwnkrOKk_64l2KgpucfLZqL3Cl7KA9NG4JGZfBAt8WmirYW"
    },
    {
      "id": 4,
      "Title": "Elon Musk: Tesla, SpaceX, and the Quest for a Fantastic Future",
      "Author": "Ashlee Vance",
      "About": "In the spirit of Steve Jobs and Moneyball, Elon Musk is both an illuminating and authorized look at the extraordinary life of one of Silicon Valley’s most exciting, unpredictable, and ambitious entrepreneurs—a real-life Tony Stark—and a fascinating exploration of the renewal of American invention and its new \"makers\". Elon Musk spotlights the technology and vision of Elon Musk, the renowned entrepreneur and innovator behind SpaceX, Tesla, and SolarCity, who sold one of his Internet companies, PayPal, for $1.5 billion. Ashlee Vance captures the full spectacle and arc of the genius’s life and work, from his tumultuous upbringing in South Africa and flight to the United States to his dramatic technical innovations and entrepreneurial pursuits.",
      "Image": "https://books.google.ca/books/content?id=Yd99BAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&imgtk=AFLRE72TDdDDpSKQVAPMTpF3xOa_VVCo_tASeIO5k4YepiWhQIYWuVQPxwaJTvcWD6e72C9E0Jq5A2XU_KULH3MbgYNprphp55cky6oZzH_EHgA-5aTj6uU_3Im_hz0o2qYac31htLRB"
    },
    {
      "id": 5,
      "Title": "Mindset: The New Psychology of Success",
      "Author": "Carol S. Dweck",
      "About": "After decades of research, world-renowned Stanford University psychologist Carol S. Dweck, Ph.D., discovered a simple but groundbreaking idea: the power of mindset. In this brilliant book, she shows how success in school, work, sports, the arts, and almost every area of human endeavor can be dramatically influenced by how we think about our talents and abilities. People with a fixed mindset—those who believe that abilities are fixed—are less likely to flourish than those with a growth mindset—those who believe that abilities can be developed. Mindset reveals how great parents, teachers, managers, and athletes can put this idea to use to foster outstanding accomplishment.",
      "Image": "https://books.google.ca/books/content?id=fdjqz0TPL2wC&printsec=frontcover&img=1&zoom=1&edge=curl&imgtk=AFLRE72AqbciksnNon_z8ZMc9y8sA8RcJPQvgmea7DGtgqcfVQWM1fByk5PwUeFT-LVE7nA2RO_65EIDsPUinVOo0hFswH8oJ-Jf4gFT6vxKnq9qS2n33Lfp1xv6Rj-H3a2kW1UcflN3"
    }
  ]
}
